app/Controllers/Home.php

    public function index(): string
    {
        // creamos una instancia para recivir valores
        $articulosModel= new ArticulosModel();
        // buscamos un id
        $articuloId=$articulosModel->find('1');
---
SELECT *
FROM `articulos`
WHERE `articulos`.`deleted_at` IS NULL
AND `articulos`.`id` = '1'